Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32WM_BZ3601_SL3.svd
            <register>
               <name>ADCCON2</name>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>ADCDIV</name>
                     <description>Shared ADC Clock Divider bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>ADCEIS</name>
                     <description>Shared ADC Early Interrupt Select bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ADCEISSelect</name>
                        <enumeratedValue>
                           <name>8CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 8 ADC clocks prior to end of conversion</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 7 ADC clocks prior to end of conversion</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 6 ADC clocks prior to end of conversion</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 5 ADC clocks prior to end of conversion</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 4 ADC clocks prior to end of conversion</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 3 ADC clocks prior to end of conversion</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 2 ADC module clocks prior to end of conversion</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1CLKS_EARLY</name>
                           <description>The data ready interrupt is generated 1 ADC module clock prior to end of conversion</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENXCNVRT</name>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSIEN</name>
                     <description>End of Scan Interrupt Enable bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EOSIENSelect</name>
                        <enumeratedValue>
                           <name>EOSRDY_INT</name>
                           <description>Interrupt will be generated when EOSRDY bit is set</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOEOSRDY_INT</name>
                           <description>No interrupt is generated when the EOSRDY bit is set</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REFFLTIEN</name>
                     <description>Band Gap/ Vref Voltage Fault Interrupt Enable bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>REFFLTIENSelect</name>
                        <enumeratedValue>
                           <name>REFFLT_INT</name>
                           <description>Interrupt will be generated when the REFFLT bit is set</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOREFFLT_INT</name>
                           <description>No interrupt is generated when the REFFLT bit is set</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BGVRIEN</name>
                     <description>Band Gap/ Vref Voltage Ready Interrupt Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BGVRIENSelect</name>
                        <enumeratedValue>
                           <name>BGVRDDY_INT</name>
                           <description>Interrupt will be generated when the BGVRDDY bit is set</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOBGVRDDY_INT</name>
                           <description>No interrupt is generated when the BGVRRDY bit is set</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAMC</name>
                     <description>Sample Time for the Shared ADC (ADC7) bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CVD_CPL</name>
                     <description>CVD Partly Line Capacitor Setting bits</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EOSRDY</name>
                     <description>End of Scan Interrupt Status bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EOSRDYSelect</name>
                        <enumeratedValue>
                           <name>SCAN_COMPLETE</name>
                           <description>All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCAN_NOT_COMPLETE</name>
                           <description>Scanning has not completed</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REFFLT</name>
                     <description>Band Gap/ Vref / AVdd BOR Fault Status bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>REFFLTSelect</name>
                        <enumeratedValue>
                           <name>BG_VREF_FLT</name>
                           <description>Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BG_VREF_OK</name>
                           <description>Band gap and Vref voltage are working properly</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BGVRRDY</name>
                     <description>Band Gap Voltage/ADC Reference Voltage Status bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BGVRRDYSelect</name>
                        <enumeratedValue>
                           <name>VREF_RDY</name>
                           <description>Both band gap voltage and ADC reference voltages (Vref) are ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VREF_NOTRDY</name>
                           <description>Either or both band gap voltage and ADC reference voltages (Vref) are not ready</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
