Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32WM_BZ3601_SL3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GPIOA</name>
         <version>024671.0</version>
         <description>GPIO</description>
         <groupName>GPIO</groupName>
         <prependToName>GPIO_</prependToName>
         <baseAddress>0x44002A00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xE0</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CHANGE_NOTICE_A</name>
            <description>PORT_A_INPUT_CHANGE_INTERRUPT</description>
            <value>4</value>
         </interrupt>
         <registers>
            <register>
               <name>ANSEL</name>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>ANS3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANS4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANS5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANS6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANS7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANS8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANS9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANS10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ANSELCLR</name>
               <addressOffset>0x04</addressOffset>
            </register>
            <register>
               <name>ANSELSET</name>
               <addressOffset>0x08</addressOffset>
            </register>
            <register>
               <name>ANSELINV</name>
               <addressOffset>0x0C</addressOffset>
            </register>
            <register>
               <name>TRIS</name>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>TRIS3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIS4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIS5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIS6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIS7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIS8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIS9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIS10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRISCLR</name>
               <addressOffset>0x14</addressOffset>
            </register>
            <register>
               <name>TRISSET</name>
               <addressOffset>0x18</addressOffset>
            </register>
            <register>
               <name>TRISINV</name>
               <addressOffset>0x1C</addressOffset>
            </register>
            <register>
               <name>PORT</name>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>R3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>R4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>R5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>R6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>R7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>R8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>R9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>R10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PORTCLR</name>
               <addressOffset>0x24</addressOffset>
            </register>
            <register>
               <name>PORTSET</name>
               <addressOffset>0x28</addressOffset>
            </register>
            <register>
               <name>PORTINV</name>
               <addressOffset>0x2C</addressOffset>
            </register>
            <register>
               <name>LAT</name>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>LAT3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAT4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAT5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAT6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAT7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAT8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAT9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LAT10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LATCLR</name>
               <addressOffset>0x34</addressOffset>
            </register>
            <register>
               <name>LATSET</name>
               <addressOffset>0x38</addressOffset>
            </register>
            <register>
               <name>LATINV</name>
               <addressOffset>0x3C</addressOffset>
            </register>
            <register>
               <name>ODC</name>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>ODC3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODC4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODC5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODC6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODC7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODC8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODC9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODC10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ODCCLR</name>
               <addressOffset>0x44</addressOffset>
            </register>
            <register>
               <name>ODCSET</name>
               <addressOffset>0x48</addressOffset>
            </register>
            <register>
               <name>ODCINV</name>
               <addressOffset>0x4C</addressOffset>
            </register>
            <register>
               <name>CNPU</name>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>CNPU3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPU4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPU5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPU6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPU7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPU8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPU9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPU10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNPUCLR</name>
               <addressOffset>0x54</addressOffset>
            </register>
            <register>
               <name>CNPUSET</name>
               <addressOffset>0x58</addressOffset>
            </register>
            <register>
               <name>CNPUINV</name>
               <addressOffset>0x5C</addressOffset>
            </register>
            <register>
               <name>CNPD</name>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>CNPD3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPD4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPD5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPD6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPD7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPD8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPD9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNPD10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNPDCLR</name>
               <addressOffset>0x64</addressOffset>
            </register>
            <register>
               <name>CNPDSET</name>
               <addressOffset>0x68</addressOffset>
            </register>
            <register>
               <name>CNPDINV</name>
               <addressOffset>0x6C</addressOffset>
            </register>
            <register>
               <name>CNCON</name>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>EDGEDETECT</name>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIDL</name>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ON</name>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNCONCLR</name>
               <addressOffset>0x74</addressOffset>
            </register>
            <register>
               <name>CNCONSET</name>
               <addressOffset>0x78</addressOffset>
            </register>
            <register>
               <name>CNCONINV</name>
               <addressOffset>0x7C</addressOffset>
            </register>
            <register>
               <name>CNEN</name>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>CNIE3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNIE4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNIE5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNIE6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNIE7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNIE8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNIE9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNIE10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNENCLR</name>
               <addressOffset>0x84</addressOffset>
            </register>
            <register>
               <name>CNENSET</name>
               <addressOffset>0x88</addressOffset>
            </register>
            <register>
               <name>CNENINV</name>
               <addressOffset>0x8C</addressOffset>
            </register>
            <register>
               <name>CNSTAT</name>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>CNSTAT3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNSTAT4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNSTAT5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNSTAT6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNSTAT7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNSTAT8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNSTATA</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNSTAT10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNSTATCLR</name>
               <addressOffset>0x94</addressOffset>
            </register>
            <register>
               <name>CNSTATSET</name>
               <addressOffset>0x98</addressOffset>
            </register>
            <register>
               <name>CNSTATINV</name>
               <addressOffset>0x9C</addressOffset>
            </register>
            <register>
               <name>CNNE</name>
               <addressOffset>0xa0</addressOffset>
               <fields>
                  <field>
                     <name>CNNE3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNNE4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNNE5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNNE6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNNE7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNNE8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNNE9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CNNE10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNNECLR</name>
               <addressOffset>0xa4</addressOffset>
            </register>
            <register>
               <name>CNNESET</name>
               <addressOffset>0xa8</addressOffset>
            </register>
            <register>
               <name>CNNEINV</name>
               <addressOffset>0xaC</addressOffset>
            </register>
