Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32WM_BZ3601_SL3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ROT</name>
         <version>04599Rev A.1</version>
         <description>Secure Root of Trust Macro</description>
         <baseAddress>0x44002C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC0C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SECCFG</name>
               <description>Secure Configuration HOLDING REGISTER1,2</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>UUID_LOCK</name>
                     <description>Programming lock bits for Unique ID fuses</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>UUID_LOCKSelect</name>
                        <enumeratedValue>
                           <name>UUID_NOT_LCK_0</name>
                           <description>Unique ID is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UUID_LCK_1</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UUID_LCK_2</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UUID_LCK_3</name>
                           <description>Unique ID is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEBUG_LOCK</name>
                     <description>Lock bits for debug/programming</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DEBUG_LOCKSelect</name>
                        <enumeratedValue>
                           <name>DEBUG_NOT_LCK_0</name>
                           <description>Debug is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEBUG_LCK_1</name>
                           <description>Debug is locked</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEBUG_LCK_2</name>
                           <description>Debug is locked</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEBUG_LCK_3</name>
                           <description>Debug is locked</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROOT_KEY_LOCK</name>
                     <description>Lock bits for storage root Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ROOT_KEY_LOCKSelect</name>
                        <enumeratedValue>
                           <name>ROOT_KEY_NOT_LCK_0</name>
                           <description>Storage root key is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROOT_KEY_LCK_1</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROOT_KEY_LCK_2</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROOT_KEY_LCK_3</name>
                           <description>Storage root key is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOT_KEY_LOCK</name>
                     <description>Lock bits for Secure Boot/OTA Key</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BOOT_KEY_LOCKSelect</name>
                        <enumeratedValue>
                           <name>BOOT_KEY_NOT_LCK_0</name>
                           <description>Secure boot key is not locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOOT_KEY_LCK_1</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOOT_KEY_LCK_2</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOOT_KEY_LCK_3</name>
                           <description>Secure boot key is locked and cannot be programmed</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADD_BOOT_KEY</name>
                     <description>Additional boot Key bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>ANTIROLLBACKCOUNTER[%s]</name>
               <description>Anti Roll back counter</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>ANTIROLLBACKCOUNTER</name>
                     <description>Anti rollback counter bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIFECYCLECTR_BOOTKEY</name>
               <description>Life cycle counter and Secure boot key LSB bytes</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>LIFECYCLECOUNTER</name>
                     <description>Life cycle counter bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>SECUREBOOTKEY_1_2</name>
                     <description>Secure boot key bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>11</dim>
               <dimIncrement>4</dimIncrement>
               <name>SECUREBOOTKEY_3_46[%s]</name>
               <description>Secure boot key</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>SECUREBOOTKEY_3_46</name>
                     <description>Secure boot key bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SECUREBOOTKEY_47_48_STORAGE_KEY</name>
               <description>Secure boot key, Storage Key</description>
               <addressOffset>0x54</addressOffset>
               <fields>
                  <field>
                     <name>SECUREBOOTKEY_47_48</name>
                     <description>Secure boot key bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>STORAGE_KEY_1_2</name>
                     <description>Storage root key bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>7</dim>
               <dimIncrement>4</dimIncrement>
               <name>STORAGE_KEY_3_30[%s]</name>
               <description>Storage Key</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>STORAGE_KEY_3_30</name>
                     <description>Storage Key bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STORAGE_KEY_FFCFG</name>
               <description>Storage Key, FFCFG</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>STORAGE_KEY_31_32</name>
                     <description>Storage Key bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FFCFG</name>
                     <description>FFCFG bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVICE_ID_PATCH_CFG</name>
               <description>Device ID and Patch CFG</description>
               <addressOffset>0x78</addressOffset>
               <fields>
                  <field>
                     <name>DEVICE_ID</name>
                     <description>Device ID bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PATCH_CFG_</name>
                     <description>Patch CFG bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PATCH_CFG</name>
               <description>Patch CFG</description>
               <addressOffset>0x7C</addressOffset>
               <fields>
                  <field>
                     <name>PATCH_CFG</name>
                     <description>Patch CFG bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>53</dim>
               <dimIncrement>4</dimIncrement>
               <name>PATCH_CODE[%s]</name>
               <description>Patch Code</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>PATCH_CODE</name>
                     <description>Patch Code bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>UUID[%s]</name>
               <description>Unique ID</description>
               <addressOffset>0x1D8</addressOffset>
               <fields>
                  <field>
                     <name>UUID</name>
                     <description>Unique ID bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SEC_BOOT</name>
               <description>Secure Boot Register</description>
               <addressOffset>0xC00</addressOffset>
               <resetValue>0x00010002</resetValue>
               <fields>
                  <field>
                     <name>SECURE_BOOT_REQD</name>
                     <description>Bits to indicate that secure boot is required on the next device reset.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SECURE_BOOT_REQDSelect</name>
                        <enumeratedValue>
                           <name>SEC_BOOT_REQD_0</name>
                           <description>Secure boot code authentication is required</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_BOOT_NOT_REQD_1</name>
                           <description>Secure boot code authentication is NOT required</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_BOOT_NOT_REQD_2</name>
                           <description>Secure boot code authentication is NOT required</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_BOOT_REQD_3</name>
                           <description>Secure boot code authentication is required</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEC_BOOT_STATUS</name>
                     <description>Bits to indicate that secure boot status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SECURE_BOOT_DONE</name>
                     <description>Bits to indicate that secure boot is done</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SECURE_BOOT_DONESelect</name>
                        <enumeratedValue>
                           <name>SEC_BOOT_DONE_0</name>
                           <description>S ecure boot is done</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_BOOT_NOT_DONE_1</name>
                           <description>S ecure boot is not done</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_BOOT_NOT_DONE_2</name>
                           <description>S ecure boot is not done</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEC_BOOT_DONE_3</name>
                           <description>S ecure boot is done</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFUSE_RWDATA</name>
               <description>EFuse RW Data Register</description>
               <addressOffset>0xC04</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>eFuse Program (Write) Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>eFuse Program/Read Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
